---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.OpeningFailures.OpeningPartiallyCutsHost
source: html/5b19788c-7d38-ce48-00a4-c4937e00854a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.OpeningFailures.OpeningPartiallyCutsHost Property

Opening partially cuts its host.

## Syntax (C#)
```csharp
public static FailureDefinitionId OpeningPartiallyCutsHost { get; }
```